In [1]:
import pandas as pd
import seaborn as sns

In [3]:
data = pd.read_csv("data/personal_train.csv")
data.head(25)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>name</th>
      <th>address</th>
      <th>age</th>
      <th>sex</th>
      <th>date_of_birth</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>Terry Terry</td>
      <td>11818 Lori Crossing Apt. 802\nPughstad, DC 78165</td>
      <td>64.0</td>
      <td>M</td>
      <td>1954-05-30 00:00:00</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>Edith Boudreaux</td>
      <td>PSC 4657, Box 5446\nAPO AP 58412</td>
      <td>37.0</td>
      <td>F</td>
      <td>1981-07-23 00:00:00</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2</td>
      <td>Janet Washington</td>
      <td>Unit 9759 Box 9470\nDPO AP 45549</td>
      <td>69.0</td>
      <td>F</td>
      <td>1949-02-16 00 00 00</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3</td>
      <td>Margaret Chabot</td>
      <td>137 Lewis Flat Suite 762\nWest Elizabeth, AL 3...</td>
      <td>78.0</td>
      <td>F</td>
      <td>1939-12-09</td>
    </tr>
    <tr>
      <th>4</th>
      <td>4</td>
      <td>Colleen Satterwhite</td>
      <td>995 Frank Stravenue\nSouth Matthewport, TX 81402</td>
      <td>34.0</td>
      <td>F</td>
      <td>1984-02-15</td>
    </tr>
    <tr>
      <th>5</th>
      <td>5</td>
      <td>Judy Smith</td>
      <td>1781 Meredith Skyway Suite 328\nCordovaburgh, ...</td>
      <td>70.0</td>
      <td>F</td>
      <td>1948-10-18</td>
    </tr>
    <tr>
      <th>6</th>
      <td>6</td>
      <td>Stephen Lalk</td>
      <td>2415 Elizabeth Knoll Suite 030\nCordovafort, C...</td>
      <td>35.0</td>
      <td>M</td>
      <td>1983-03-22</td>
    </tr>
    <tr>
      <th>7</th>
      <td>7</td>
      <td>Abraham Bruce</td>
      <td>49824 Kim View\nWest Ericborough, VT 42457</td>
      <td>73.0</td>
      <td>M</td>
      <td>1945-07-27</td>
    </tr>
    <tr>
      <th>8</th>
      <td>8</td>
      <td>Anna Swartz</td>
      <td>53231 Matthew Spur Apt. 079\nNorth Brian, MA 3...</td>
      <td>46.0</td>
      <td>F</td>
      <td>09/02/1972</td>
    </tr>
    <tr>
      <th>9</th>
      <td>9</td>
      <td>James Wilson</td>
      <td>USNV Gallegos\nFPO AA 99743</td>
      <td>74.0</td>
      <td>M</td>
      <td>1944-02-19</td>
    </tr>
    <tr>
      <th>10</th>
      <td>10</td>
      <td>Patricia Kealy</td>
      <td>655 Karen Causeway\nBenjaminberg, NY 46590</td>
      <td>59.0</td>
      <td>F</td>
      <td>59-02-03</td>
    </tr>
    <tr>
      <th>11</th>
      <td>11</td>
      <td>Morgan Toole</td>
      <td>9197 Juarez Lock\nNew Matthew, VA 12312</td>
      <td>45.0</td>
      <td>F</td>
      <td>1973-04-16</td>
    </tr>
    <tr>
      <th>12</th>
      <td>12</td>
      <td>Roy Wilson</td>
      <td>9892 Stephen Track Suite 831\nSharonstad, TN 1...</td>
      <td>35.0</td>
      <td>M</td>
      <td>14/05/1983</td>
    </tr>
    <tr>
      <th>13</th>
      <td>13</td>
      <td>Betty Kannel</td>
      <td>62673 Jeanette Track Apt. 852\nMckenzieberg, W...</td>
      <td>67.0</td>
      <td>F</td>
      <td>1950-11-10</td>
    </tr>
    <tr>
      <th>14</th>
      <td>14</td>
      <td>Patricia Wasilewski</td>
      <td>85154 Young Mill\nAaronville, IA 31780</td>
      <td>55.0</td>
      <td>F</td>
      <td>10/02/1963</td>
    </tr>
    <tr>
      <th>15</th>
      <td>15</td>
      <td>Lori Scott</td>
      <td>509 Antonio Haven Suite 117\nWest Ricky, OK 35203</td>
      <td>26.0</td>
      <td>F</td>
      <td>1992-09-30 00 00 00</td>
    </tr>
    <tr>
      <th>16</th>
      <td>16</td>
      <td>Carl Young</td>
      <td>024 Jordan Plains Suite 643\nAndreamouth, WI 5...</td>
      <td>63.0</td>
      <td>?</td>
      <td>10/08/1955</td>
    </tr>
    <tr>
      <th>17</th>
      <td>17</td>
      <td>Karen Boyles</td>
      <td>31259 Porter Gateway Suite 886\nEast Sarahfort...</td>
      <td>28.0</td>
      <td>F</td>
      <td>1990-02-05</td>
    </tr>
    <tr>
      <th>18</th>
      <td>18</td>
      <td>Ronald Speigel</td>
      <td>USNV Robinson\nFPO AA 16102</td>
      <td>56.0</td>
      <td>M</td>
      <td>1962-04-27 00 00 00</td>
    </tr>
    <tr>
      <th>19</th>
      <td>19</td>
      <td>Michael Guzman</td>
      <td>6135 Keith Route Apt. 868\nAbigailchester, OK ...</td>
      <td>73.0</td>
      <td>M</td>
      <td>1944-12-09</td>
    </tr>
    <tr>
      <th>20</th>
      <td>20</td>
      <td>Elizabeth Davis</td>
      <td>30989 Robert Stream Apt. 520\nJorgehaven, MS 9...</td>
      <td>32.0</td>
      <td>F</td>
      <td>86-06-07</td>
    </tr>
    <tr>
      <th>21</th>
      <td>21</td>
      <td>Debra White</td>
      <td>6934 Victor Turnpike Apt. 644\nLake Paulamouth...</td>
      <td>86.0</td>
      <td>F</td>
      <td>1931-12-20</td>
    </tr>
    <tr>
      <th>22</th>
      <td>22</td>
      <td>Spencer Castano</td>
      <td>83150 James Isle Suite 616\nLake Christinaton,...</td>
      <td>31.0</td>
      <td>M</td>
      <td>04/08/1987</td>
    </tr>
    <tr>
      <th>23</th>
      <td>23</td>
      <td>Kelly Webb</td>
      <td>2397 Powell Skyway Apt. 944\nNew Brianport, PA...</td>
      <td>22.0</td>
      <td>F</td>
      <td>1996-01-17</td>
    </tr>
    <tr>
      <th>24</th>
      <td>24</td>
      <td>Hoyt Martinez</td>
      <td>58132 Emily Club Apt. 346\nEmmaborough, LA 16007</td>
      <td>47.0</td>
      <td>M</td>
      <td>1971-07-24</td>
    </tr>
  </tbody>
</table>
</div>

# Dataset personal_train.csv
Mat ulozeny vek je zbytocne ak mame datum narodenia, navyse vo veku v niektorych pripadoch su ocividne chybne udaje  
Datumy narodenia su v roznych formatoch (niektore maju aj cas, ktory nepotrebujeme)  
Novy riadok v adrese?  
Prvy stlpec by mohol mat aspon nejaky nazov (vyzera to na nejake id)
Pohlavie ma aj ?

In [7]:
data.describe()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>age</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>2237.000000</td>
      <td>2236.000000</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>1118.000000</td>
      <td>46.155635</td>
    </tr>
    <tr>
      <th>std</th>
      <td>645.910598</td>
      <td>1693.680216</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.000000</td>
      <td>-8900.000000</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>559.000000</td>
      <td>35.000000</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>1118.000000</td>
      <td>54.000000</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>1677.000000</td>
      <td>69.000000</td>
    </tr>
    <tr>
      <th>max</th>
      <td>2236.000000</td>
      <td>8900.000000</td>
    </tr>
  </tbody>
</table>
</div>

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2237 entries, 0 to 2236
Data columns (total 6 columns):
Unnamed: 0       2237 non-null int64
name             2237 non-null object
address          2237 non-null object
age              2236 non-null float64
sex              2237 non-null object
date_of_birth    2236 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 104.9+ KB

In [9]:
data['sex'].unique()

array(['M', 'F', '?'], dtype=object)

In [2]:
other = pd.read_csv("data/other_train.csv")
other['TBG'].unique()

array(['?', nan], dtype=object)

In [3]:

other.columns

Index(['Unnamed: 0', 'name', 'address', 'FTI measured', 'education', 'lithium',
       'TT4', 'T4U', 'capital-loss', 'capital-gain', 'on thyroxine', 'tumor',
       'TSH', 'T3', 'fnlwgt', 'hours-per-week', 'relationship',
       'thyroid surgery', 'workclass', 'I131 treatment', 'class',
       'marital-status', 'goitre', 'native-country', 'hypopituitary',
       'query on thyroxine', 'medical_info', 'T3 measured', 'referral source',
       'education-num', 'occupation', 'TBG measured', 'TBG', 'race',
       'pregnant'],
      dtype='object')

In [4]:
other.describe()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>TT4</th>
      <th>T4U</th>
      <th>capital-gain</th>
      <th>TSH</th>
      <th>T3</th>
      <th>fnlwgt</th>
      <th>hours-per-week</th>
      <th>education-num</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>2287.000000</td>
      <td>2124.000000</td>
      <td>2036.000000</td>
      <td>2280.000000</td>
      <td>2043.000000</td>
      <td>1800.000000</td>
      <td>2278.000000</td>
      <td>2275.000000</td>
      <td>2044.000000</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>1143.000000</td>
      <td>109.394727</td>
      <td>0.996259</td>
      <td>761.108772</td>
      <td>4.522736</td>
      <td>2.023833</td>
      <td>187526.347234</td>
      <td>38.338462</td>
      <td>10.044031</td>
    </tr>
    <tr>
      <th>std</th>
      <td>660.344355</td>
      <td>35.793095</td>
      <td>0.193135</td>
      <td>6264.103513</td>
      <td>20.220951</td>
      <td>0.818254</td>
      <td>101945.538600</td>
      <td>12.171910</td>
      <td>2.480273</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.000000</td>
      <td>2.000000</td>
      <td>0.310000</td>
      <td>0.000000</td>
      <td>0.005000</td>
      <td>0.050000</td>
      <td>19491.000000</td>
      <td>1.000000</td>
      <td>1.000000</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>571.500000</td>
      <td>88.000000</td>
      <td>0.880000</td>
      <td>0.000000</td>
      <td>0.450000</td>
      <td>1.600000</td>
      <td>117343.500000</td>
      <td>35.000000</td>
      <td>9.000000</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>1143.000000</td>
      <td>104.000000</td>
      <td>0.980000</td>
      <td>0.000000</td>
      <td>1.400000</td>
      <td>2.000000</td>
      <td>177675.000000</td>
      <td>40.000000</td>
      <td>10.000000</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>1714.500000</td>
      <td>126.000000</td>
      <td>1.080000</td>
      <td>0.000000</td>
      <td>2.600000</td>
      <td>2.400000</td>
      <td>232741.500000</td>
      <td>40.000000</td>
      <td>12.000000</td>
    </tr>
    <tr>
      <th>max</th>
      <td>2286.000000</td>
      <td>430.000000</td>
      <td>2.120000</td>
      <td>99999.000000</td>
      <td>478.000000</td>
      <td>10.600000</td>
      <td>799281.000000</td>
      <td>99.000000</td>
      <td>16.000000</td>
    </tr>
  </tbody>
</table>
</div>

In [5]:
other.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2287 entries, 0 to 2286
Data columns (total 35 columns):
Unnamed: 0            2287 non-null int64
name                  2287 non-null object
address               2287 non-null object
FTI measured          2278 non-null object
education             2280 non-null object
lithium               2280 non-null object
TT4                   2124 non-null float64
T4U                   2036 non-null float64
capital-loss          2134 non-null object
capital-gain          2280 non-null float64
on thyroxine          2275 non-null object
tumor                 2273 non-null object
TSH                   2043 non-null float64
T3                    1800 non-null float64
fnlwgt                2278 non-null float64
hours-per-week        2275 non-null float64
relationship          2278 non-null object
thyroid surgery       2276 non-null object
workclass             2278 non-null object
I131 treatment        2278 non-null object
class                 2280 non-null object
marital-status        2280 non-null object
goitre                2275 non-null object
native-country        2281 non-null object
hypopituitary         2283 non-null object
query on thyroxine    2274 non-null object
medical_info          2274 non-null object
T3 measured           2281 non-null object
referral source       2282 non-null object
education-num         2044 non-null float64
occupation            2282 non-null object
TBG measured          2275 non-null object
TBG                   2277 non-null object
race                  2280 non-null object
pregnant              2279 non-null object
dtypes: float64(8), int64(1), object(26)
memory usage: 625.4+ KB

In [8]:
other['FTI measured'].unique()

In [7]:
other['TBG measured'].unique()

array(['f', nan, 'f.14'], dtype=object)

In [9]:
other['TBG'].unique()

array(['?', nan], dtype=object)

In [10]:
other.lithium.unique()

array(['f', nan, 't', 'f.9'], dtype=object)

In [11]:
other['on thyroxine'].unique()

array(['f', 't', nan], dtype=object)

In [13]:

other['tumor'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [14]:

other['relationship'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [15]:
other['thyroid surgery'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [18]:
other['workclass'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [19]:

other['I131 treatment'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [25]:

other['class'].head(25).str.partition('|')

array(['f', 't', nan, 'f.4'], dtype=object)

In [26]:
other['marital-status'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [28]:

other['goitre'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [29]:

other['native-country'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [30]:
other['hypopituitary'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [31]:
other['query on thyroxine'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [32]:

other['T3 measured'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [33]:
other['referral source'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [34]:
other['occupation'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [35]:
other['race'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

In [36]:
other['pregnant'].unique()

array(['f', 't', nan, 'f.4'], dtype=object)

array(['f', 't', nan, 'f.4'], dtype=object)

TBG neobsahuje ziadne hodnoty - je tam bud ? alebo null
v udajoch su prazdne hodnoty reprezentovane ? aj null (NaN)
1. stlpec bez nazvu chce byt nejake ID
nazov stlpca goitre fnlwgt nedava zmysel a T4 T3 T4U TSH TBG TBG measured nevieme co znamena
FTI measured obsahuje okrem t, f a nan aj T.4
TBG measured obsahuje f, nan a f.14 - toto nam asi nebude moc napomocne
tumor ma f a t a f.11
thyroid surgery ma t a f a f.5
workclass ma ? aj nan
I131 treatment ma f a t a nan a f.6
class - predpona pred | je s malym aj velkym pismenom, ocazne aj je, co sa tento stlpec vlastne snazi povedat
goitre - f t nan a f.10
native country ma ?
hypopituitary - f nan a f.12 - asi dost zbytocne
query on thyroxine f nan t a f.1
medical info ma v sebe JSON s viacerymi udajmi, asi by sa to oplatilo rozbit na viac stlpcov
T3 measured ma f t nan a t.1
occupation ma o.i. aj ? aj nan